#include <stdio.h>

int main(){
    int count;
    // printf("How many students: ");
    scanf("%d",&count); // จำนวนแถวแนวนอน(Horizontal)

    int student[count][3];
    // int student[10001][3]; // แถว * หลัก
    float total = 0; // คะแนนรวมทุกรายวิชา
    float v1 = 0, v2 = 0, v3 = 0; // ตัวแทนของแถวแนวตั้ง(Vertical)โจทย์บอกมีสามวิชา ก็สามแถว

    for(int i = 0; i < count; i++){
        // printf("Enter score: ");
        scanf("%d %d %d",&student[i][0], &student[i][1], &student[i][2]);
        // แถวแนวตั้ง ที่ 1 บวกกันเอง เช่นเดียวกับแถวแนวตั้งที่ 2 และ 3 ซึ่งแถวแต่ละแถว คือ คะแนนรวมรายวิชา
        v1 += student[i][0];
        v2 += student[i][1];
        v3 += student[i][2];
        //แถวแนวนอนบวกกันเอง โดยแถวแนวนอนลำดับที่ i ซึ่งแต่ละแถวคือ คะแนนรวมทุกรายวิชา
        total += student[i][0] + student[i][1] + student[i][2];
    }
    // การหาค่าเฉลี่ยของแต่ละรายวิชา
    v1 /= count;
    v2 /= count;
    v3 /= count;
    //การหาค่าเฉลี่ยของทุกรายวิชารวมกัน
    total /= count;

    for(int i = 0; i < count; i++){
        int check = 0; // เป็นตัวแปรที่บอกว่า ถ้าหากรายวิชานี้ x คะแนนมากกว่า คะแนนเฉลี่ยวิชา x ก็จะเพิ่มแต้ม
        // ถ้าคะแนนวิชาใด วิชานึงเป็น 0 ข้ามเลย ไปเป็นนักเรียนคนถัดไป
        if(student[i][0] == 0 || student[i][1] == 0 || student[i][2] == 0){
            continue;
        }
        // ถ้าคะแนนรวมของทุกสามวิชา น้อยกว่า วิชาชาทั้งหมดรวมกันที่หารหาค่า เฉลี่ยแล้ว ข้ามไปนักเรียนคนถัดไป
        if((student[i][0] + student[i][1] + student[i][2]) < total){
            continue;
        }
        // ถ้าคะแนนของวิชา x ของนักเรียนคนนี้ มากกว่า ค่าเฉลี่ยของคะแนนวิชา x ก็จะผ่าน ให้ check ++
        if(student[i][0] >= v1) {check ++;}
        if(student[i][1] >= v2) {check ++;}
        if(student[i][2] >= v3) {check ++;}
        // ถ้านักเรียนมี check < 2 ก็คือ นักเรียนไม่ผ่าน ซึ่งหมายความ นักเรียนมีคะแนนน้อยกว่า คะแนนค่าเฉลี่ยของวิชานั้นๆ 2 วิชา ก็ให้ข้ามไปเลย
        if(check < 2){
            continue;
        }
        // แต่ถ้านักเรียนมีคะแนนรายวิชานั้นๆ มากกว่า คะแนนเฉลี่ยของวิชานั้นๆ  2 วิชาขึ้นไป
        printf("%d ",i+1);
    }
}